app/controllers/notes_controller.rb

	def index
		@notes=current_user.note.all
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ?  [["user_id", 1]]

	def show
		@note=current_user.note.find(params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]

	def create
		#render plain: params[:notes].inspect
		@note=current_user.note.new(note_params)
		if(@note.save)
---
INSERT INTO "notes" ("title", "note", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "note3"], ["note", ""], ["created_at", "2020-02-17 06:18:40.794109"], ["updated_at", "2020-02-17 06:18:40.794109"], ["user_id", 1]]

	def destroy
		@note=current_user.note.find(params[:id])
		@note.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = ? AND "notes"."id" = ? LIMIT ?  [["user_id", 1], ["id", 5], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 4]]